GopalSaraf/Practicals/PSDL/include/proc/pic16lf1782.inc
// Register: PSMC2INT
#define PSMC2INT PSMC2INT
PSMC2INT                                 equ 0840h
// bitfield definitions
PSMC2INT_P2TPRIF_POSN                    equ 0000h
PSMC2INT_P2TPRIF_POSITION                equ 0000h
PSMC2INT_P2TPRIF_SIZE                    equ 0001h
PSMC2INT_P2TPRIF_LENGTH                  equ 0001h
PSMC2INT_P2TPRIF_MASK                    equ 0001h
PSMC2INT_P2TDCIF_POSN                    equ 0001h
PSMC2INT_P2TDCIF_POSITION                equ 0001h
PSMC2INT_P2TDCIF_SIZE                    equ 0001h
PSMC2INT_P2TDCIF_LENGTH                  equ 0001h
PSMC2INT_P2TDCIF_MASK                    equ 0002h
PSMC2INT_P2TPHIF_POSN                    equ 0002h
PSMC2INT_P2TPHIF_POSITION                equ 0002h
PSMC2INT_P2TPHIF_SIZE                    equ 0001h
PSMC2INT_P2TPHIF_LENGTH                  equ 0001h
PSMC2INT_P2TPHIF_MASK                    equ 0004h
PSMC2INT_P2TOVIF_POSN                    equ 0003h
PSMC2INT_P2TOVIF_POSITION                equ 0003h
PSMC2INT_P2TOVIF_SIZE                    equ 0001h
PSMC2INT_P2TOVIF_LENGTH                  equ 0001h
PSMC2INT_P2TOVIF_MASK                    equ 0008h
PSMC2INT_P2TPRIE_POSN                    equ 0004h
PSMC2INT_P2TPRIE_POSITION                equ 0004h
PSMC2INT_P2TPRIE_SIZE                    equ 0001h
PSMC2INT_P2TPRIE_LENGTH                  equ 0001h
PSMC2INT_P2TPRIE_MASK                    equ 0010h
PSMC2INT_P2TDCIE_POSN                    equ 0005h
PSMC2INT_P2TDCIE_POSITION                equ 0005h
PSMC2INT_P2TDCIE_SIZE                    equ 0001h
PSMC2INT_P2TDCIE_LENGTH                  equ 0001h
PSMC2INT_P2TDCIE_MASK                    equ 0020h
PSMC2INT_P2TPHIE_POSN                    equ 0006h
PSMC2INT_P2TPHIE_POSITION                equ 0006h
PSMC2INT_P2TPHIE_SIZE                    equ 0001h
PSMC2INT_P2TPHIE_LENGTH                  equ 0001h
PSMC2INT_P2TPHIE_MASK                    equ 0040h
PSMC2INT_P2TOVIE_POSN                    equ 0007h
PSMC2INT_P2TOVIE_POSITION                equ 0007h
PSMC2INT_P2TOVIE_SIZE                    equ 0001h
PSMC2INT_P2TOVIE_LENGTH                  equ 0001h
PSMC2INT_P2TOVIE_MASK                    equ 0080h

// Register: PSMC2PHL
#define PSMC2PHL PSMC2PHL
PSMC2PHL                                 equ 0841h
// bitfield definitions
PSMC2PHL_PSMC2PH0_POSN                   equ 0000h
PSMC2PHL_PSMC2PH0_POSITION               equ 0000h
PSMC2PHL_PSMC2PH0_SIZE                   equ 0001h
PSMC2PHL_PSMC2PH0_LENGTH                 equ 0001h
PSMC2PHL_PSMC2PH0_MASK                   equ 0001h
PSMC2PHL_PSMC2PH1_POSN                   equ 0001h
PSMC2PHL_PSMC2PH1_POSITION               equ 0001h
PSMC2PHL_PSMC2PH1_SIZE                   equ 0001h
PSMC2PHL_PSMC2PH1_LENGTH                 equ 0001h
PSMC2PHL_PSMC2PH1_MASK                   equ 0002h
PSMC2PHL_PSMC2PH2_POSN                   equ 0002h
PSMC2PHL_PSMC2PH2_POSITION               equ 0002h
PSMC2PHL_PSMC2PH2_SIZE                   equ 0001h
PSMC2PHL_PSMC2PH2_LENGTH                 equ 0001h
PSMC2PHL_PSMC2PH2_MASK                   equ 0004h
PSMC2PHL_PSMC2PH3_POSN                   equ 0003h
PSMC2PHL_PSMC2PH3_POSITION               equ 0003h
PSMC2PHL_PSMC2PH3_SIZE                   equ 0001h
PSMC2PHL_PSMC2PH3_LENGTH                 equ 0001h
PSMC2PHL_PSMC2PH3_MASK                   equ 0008h
PSMC2PHL_PSMC2PH4_POSN                   equ 0004h
PSMC2PHL_PSMC2PH4_POSITION               equ 0004h
PSMC2PHL_PSMC2PH4_SIZE                   equ 0001h
PSMC2PHL_PSMC2PH4_LENGTH                 equ 0001h
PSMC2PHL_PSMC2PH4_MASK                   equ 0010h
PSMC2PHL_PSMC2PH5_POSN                   equ 0005h
PSMC2PHL_PSMC2PH5_POSITION               equ 0005h
PSMC2PHL_PSMC2PH5_SIZE                   equ 0001h
PSMC2PHL_PSMC2PH5_LENGTH                 equ 0001h
PSMC2PHL_PSMC2PH5_MASK                   equ 0020h
PSMC2PHL_PSMC2PH6_POSN                   equ 0006h
PSMC2PHL_PSMC2PH6_POSITION               equ 0006h
PSMC2PHL_PSMC2PH6_SIZE                   equ 0001h
PSMC2PHL_PSMC2PH6_LENGTH                 equ 0001h
PSMC2PHL_PSMC2PH6_MASK                   equ 0040h
PSMC2PHL_PSMC2PH7_POSN                   equ 0007h
PSMC2PHL_PSMC2PH7_POSITION               equ 0007h
PSMC2PHL_PSMC2PH7_SIZE                   equ 0001h
PSMC2PHL_PSMC2PH7_LENGTH                 equ 0001h
PSMC2PHL_PSMC2PH7_MASK                   equ 0080h

// Register: PSMC2PHH
#define PSMC2PHH PSMC2PHH
PSMC2PHH                                 equ 0842h
// bitfield definitions
PSMC2PHH_PSMC2PH8_POSN                   equ 0000h
PSMC2PHH_PSMC2PH8_POSITION               equ 0000h
PSMC2PHH_PSMC2PH8_SIZE                   equ 0001h
PSMC2PHH_PSMC2PH8_LENGTH                 equ 0001h
PSMC2PHH_PSMC2PH8_MASK                   equ 0001h
PSMC2PHH_PSMC2PH9_POSN                   equ 0001h
PSMC2PHH_PSMC2PH9_POSITION               equ 0001h
PSMC2PHH_PSMC2PH9_SIZE                   equ 0001h
PSMC2PHH_PSMC2PH9_LENGTH                 equ 0001h
PSMC2PHH_PSMC2PH9_MASK                   equ 0002h
PSMC2PHH_PSMC2PH10_POSN                  equ 0002h
PSMC2PHH_PSMC2PH10_POSITION              equ 0002h
PSMC2PHH_PSMC2PH10_SIZE                  equ 0001h
PSMC2PHH_PSMC2PH10_LENGTH                equ 0001h
PSMC2PHH_PSMC2PH10_MASK                  equ 0004h
PSMC2PHH_PSMC2PH11_POSN                  equ 0003h
PSMC2PHH_PSMC2PH11_POSITION              equ 0003h
PSMC2PHH_PSMC2PH11_SIZE                  equ 0001h
PSMC2PHH_PSMC2PH11_LENGTH                equ 0001h
PSMC2PHH_PSMC2PH11_MASK                  equ 0008h
PSMC2PHH_PSMC2PH12_POSN                  equ 0004h
PSMC2PHH_PSMC2PH12_POSITION              equ 0004h
PSMC2PHH_PSMC2PH12_SIZE                  equ 0001h
PSMC2PHH_PSMC2PH12_LENGTH                equ 0001h
PSMC2PHH_PSMC2PH12_MASK                  equ 0010h
PSMC2PHH_PSMC2PH13_POSN                  equ 0005h
PSMC2PHH_PSMC2PH13_POSITION              equ 0005h
PSMC2PHH_PSMC2PH13_SIZE                  equ 0001h
PSMC2PHH_PSMC2PH13_LENGTH                equ 0001h
PSMC2PHH_PSMC2PH13_MASK                  equ 0020h
PSMC2PHH_PSMC2PH14_POSN                  equ 0006h
PSMC2PHH_PSMC2PH14_POSITION              equ 0006h
PSMC2PHH_PSMC2PH14_SIZE                  equ 0001h
PSMC2PHH_PSMC2PH14_LENGTH                equ 0001h
PSMC2PHH_PSMC2PH14_MASK                  equ 0040h
PSMC2PHH_PSMC2PH15_POSN                  equ 0007h
PSMC2PHH_PSMC2PH15_POSITION              equ 0007h
PSMC2PHH_PSMC2PH15_SIZE                  equ 0001h
PSMC2PHH_PSMC2PH15_LENGTH                equ 0001h
PSMC2PHH_PSMC2PH15_MASK                  equ 0080h

