GopalSaraf/Practicals/PSDL/include/proc/pic16lf1782.inc
#define P1DCSIN                          BANKMASK(PSMC1DCS), 7
#define P1DCST                           BANKMASK(PSMC1DCS), 0
#define P1FEBM0                          BANKMASK(PSMC1BLNK), 4
#define P1FEBM1                          BANKMASK(PSMC1BLNK), 5
#define P1FEBSC1                         BANKMASK(PSMC1FEBS), 1
#define P1FEBSC2                         BANKMASK(PSMC1FEBS), 2
#define P1FEBSC3                         BANKMASK(PSMC1FEBS), 3
#define P1FEBSIN                         BANKMASK(PSMC1FEBS), 7
#define P1HSMEN                          BANKMASK(PSMC1STR1), 0
#define P1INPOL                          BANKMASK(PSMC1POL), 6
#define P1LSMEN                          BANKMASK(PSMC1STR1), 1
#define P1M0                             BANKMASK(CCP1CON), 6
#define P1M1                             BANKMASK(CCP1CON), 7
#define P1MDLBIT                         BANKMASK(PSMC1MDL), 5
#define P1MDLEN                          BANKMASK(PSMC1MDL), 7
#define P1MDLPOL                         BANKMASK(PSMC1MDL), 6
#define P1MODE0                          BANKMASK(PSMC1CON), 0
#define P1MODE1                          BANKMASK(PSMC1CON), 1
#define P1MODE2                          BANKMASK(PSMC1CON), 2
#define P1MODE3                          BANKMASK(PSMC1CON), 3
#define P1MSRC0                          BANKMASK(PSMC1MDL), 0
#define P1MSRC1                          BANKMASK(PSMC1MDL), 1
#define P1MSRC2                          BANKMASK(PSMC1MDL), 2
#define P1MSRC3                          BANKMASK(PSMC1MDL), 3
#define P1OEA                            BANKMASK(PSMC1OEN), 0
#define P1OEB                            BANKMASK(PSMC1OEN), 1
#define P1OEC                            BANKMASK(PSMC1OEN), 2
#define P1OED                            BANKMASK(PSMC1OEN), 3
#define P1OEE                            BANKMASK(PSMC1OEN), 4
#define P1OEF                            BANKMASK(PSMC1OEN), 5
#define P1PHSC1                          BANKMASK(PSMC1PHS), 1
#define P1PHSC2                          BANKMASK(PSMC1PHS), 2
#define P1PHSC3                          BANKMASK(PSMC1PHS), 3
#define P1PHSIN                          BANKMASK(PSMC1PHS), 7
#define P1PHST                           BANKMASK(PSMC1PHS), 0
#define P1POLA                           BANKMASK(PSMC1POL), 0
#define P1POLB                           BANKMASK(PSMC1POL), 1
#define P1POLC                           BANKMASK(PSMC1POL), 2
#define P1POLD                           BANKMASK(PSMC1POL), 3
#define P1POLE                           BANKMASK(PSMC1POL), 4
#define P1POLF                           BANKMASK(PSMC1POL), 5
#define P1PRSC1                          BANKMASK(PSMC1PRS), 1
#define P1PRSC2                          BANKMASK(PSMC1PRS), 2
#define P1PRSC3                          BANKMASK(PSMC1PRS), 3
#define P1PRSIN                          BANKMASK(PSMC1PRS), 7
#define P1PRST                           BANKMASK(PSMC1PRS), 0
#define P1REBM0                          BANKMASK(PSMC1BLNK), 0
#define P1REBM1                          BANKMASK(PSMC1BLNK), 1
#define P1REBSC1                         BANKMASK(PSMC1REBS), 1
#define P1REBSC2                         BANKMASK(PSMC1REBS), 2
#define P1REBSC3                         BANKMASK(PSMC1REBS), 3
#define P1REBSIN                         BANKMASK(PSMC1REBS), 7
#define P1SSYNC                          BANKMASK(PSMC1STR1), 7
#define P1STRA                           BANKMASK(PSMC1STR0), 0
#define P1STRB                           BANKMASK(PSMC1STR0), 1
#define P1STRC                           BANKMASK(PSMC1STR0), 2
#define P1STRD                           BANKMASK(PSMC1STR0), 3
#define P1STRE                           BANKMASK(PSMC1STR0), 4
#define P1STRF                           BANKMASK(PSMC1STR0), 5
#define P1SYNC0                          BANKMASK(PSMC1SYNC), 0
#define P1SYNC1                          BANKMASK(PSMC1SYNC), 1
#define P1TDCIE                          BANKMASK(PSMC1INT), 5
#define P1TDCIF                          BANKMASK(PSMC1INT), 1
#define P1TOVIE                          BANKMASK(PSMC1INT), 7
#define P1TOVIF                          BANKMASK(PSMC1INT), 3
#define P1TPHIE                          BANKMASK(PSMC1INT), 6
#define P1TPHIF                          BANKMASK(PSMC1INT), 2
#define P1TPRIE                          BANKMASK(PSMC1INT), 4
#define P1TPRIF                          BANKMASK(PSMC1INT), 0
#define P2ARSEN                          BANKMASK(PSMC2ASDC), 5
#define P2ASDEN                          BANKMASK(PSMC2ASDC), 6
#define P2ASDLA                          BANKMASK(PSMC2ASDL), 0
#define P2ASDLB                          BANKMASK(PSMC2ASDL), 1
#define P2ASDOV                          BANKMASK(PSMC2ASDC), 0
#define P2ASDSC1                         BANKMASK(PSMC2ASDS), 1
#define P2ASDSC2                         BANKMASK(PSMC2ASDS), 2
#define P2ASDSC3                         BANKMASK(PSMC2ASDS), 3
#define P2ASDSIN                         BANKMASK(PSMC2ASDS), 7
#define P2ASE                            BANKMASK(PSMC2ASDC), 7
#define P2CPRE0                          BANKMASK(PSMC2CLK), 4
#define P2CPRE1                          BANKMASK(PSMC2CLK), 5
#define P2CSRC0                          BANKMASK(PSMC2CLK), 0
#define P2CSRC1                          BANKMASK(PSMC2CLK), 1
#define P2DBFE                           BANKMASK(PSMC2CON), 5
#define P2DBRE                           BANKMASK(PSMC2CON), 4
#define P2DCSC1                          BANKMASK(PSMC2DCS), 1
#define P2DCSC2                          BANKMASK(PSMC2DCS), 2
#define P2DCSC3                          BANKMASK(PSMC2DCS), 3
#define P2DCSIN                          BANKMASK(PSMC2DCS), 7
#define P2DCST                           BANKMASK(PSMC2DCS), 0
#define P2FEBM0                          BANKMASK(PSMC2BLNK), 4
#define P2FEBM1                          BANKMASK(PSMC2BLNK), 5
#define P2FEBSC1                         BANKMASK(PSMC2FEBS), 1
#define P2FEBSC2                         BANKMASK(PSMC2FEBS), 2
#define P2FEBSC3                         BANKMASK(PSMC2FEBS), 3
#define P2FEBSIN                         BANKMASK(PSMC2FEBS), 7
#define P2HSMEN                          BANKMASK(PSMC2STR1), 0
#define P2INPOL                          BANKMASK(PSMC2POL), 6
#define P2LSMEN                          BANKMASK(PSMC2STR1), 1
#define P2M0                             BANKMASK(CCP2CON), 6
#define P2M1                             BANKMASK(CCP2CON), 7
#define P2MDLBIT                         BANKMASK(PSMC2MDL), 5
#define P2MDLEN                          BANKMASK(PSMC2MDL), 7
#define P2MDLPOL                         BANKMASK(PSMC2MDL), 6
#define P2MODE0                          BANKMASK(PSMC2CON), 0
#define P2MODE1                          BANKMASK(PSMC2CON), 1
#define P2MODE2                          BANKMASK(PSMC2CON), 2
#define P2MODE3                          BANKMASK(PSMC2CON), 3
#define P2MSRC0                          BANKMASK(PSMC2MDL), 0
#define P2MSRC1                          BANKMASK(PSMC2MDL), 1
#define P2MSRC2                          BANKMASK(PSMC2MDL), 2
#define P2MSRC3                          BANKMASK(PSMC2MDL), 3
#define P2OEA                            BANKMASK(PSMC2OEN), 0
#define P2OEB                            BANKMASK(PSMC2OEN), 1
#define P2PHSC1                          BANKMASK(PSMC2PHS), 1
#define P2PHSC2                          BANKMASK(PSMC2PHS), 2
#define P2PHSC3                          BANKMASK(PSMC2PHS), 3
#define P2PHSIN                          BANKMASK(PSMC2PHS), 7
#define P2PHST                           BANKMASK(PSMC2PHS), 0
#define P2POLA                           BANKMASK(PSMC2POL), 0
#define P2POLB                           BANKMASK(PSMC2POL), 1
#define P2PRSC1                          BANKMASK(PSMC2PRS), 1
#define P2PRSC2                          BANKMASK(PSMC2PRS), 2
#define P2PRSC3                          BANKMASK(PSMC2PRS), 3
#define P2PRSIN                          BANKMASK(PSMC2PRS), 7
#define P2PRST                           BANKMASK(PSMC2PRS), 0
#define P2REBM0                          BANKMASK(PSMC2BLNK), 0
#define P2REBM1                          BANKMASK(PSMC2BLNK), 1
#define P2REBSC1                         BANKMASK(PSMC2REBS), 1
#define P2REBSC2                         BANKMASK(PSMC2REBS), 2
#define P2REBSC3                         BANKMASK(PSMC2REBS), 3
#define P2REBSIN                         BANKMASK(PSMC2REBS), 7
#define P2SSYNC                          BANKMASK(PSMC2STR1), 7
#define P2STRA                           BANKMASK(PSMC2STR0), 0
#define P2STRB                           BANKMASK(PSMC2STR0), 1
#define P2SYNC0                          BANKMASK(PSMC2SYNC), 0
#define P2SYNC1                          BANKMASK(PSMC2SYNC), 1
#define P2TDCIE                          BANKMASK(PSMC2INT), 5
#define P2TDCIF                          BANKMASK(PSMC2INT), 1
#define P2TOVIE                          BANKMASK(PSMC2INT), 7
#define P2TOVIF                          BANKMASK(PSMC2INT), 3
#define P2TPHIE                          BANKMASK(PSMC2INT), 6
#define P2TPHIF                          BANKMASK(PSMC2INT), 2
#define P2TPRIE                          BANKMASK(PSMC2INT), 4
#define P2TPRIF                          BANKMASK(PSMC2INT), 0
#define PCIE                             BANKMASK(SSPCON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSPCON2), 2
#define PLLR                             BANKMASK(OSCSTAT), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PSMC1BLKF0                       BANKMASK(PSMC1BLKF), 0
#define PSMC1BLKF1                       BANKMASK(PSMC1BLKF), 1
#define PSMC1BLKF2                       BANKMASK(PSMC1BLKF), 2
#define PSMC1BLKF3                       BANKMASK(PSMC1BLKF), 3
#define PSMC1BLKF4                       BANKMASK(PSMC1BLKF), 4
#define PSMC1BLKF5                       BANKMASK(PSMC1BLKF), 5
#define PSMC1BLKF6                       BANKMASK(PSMC1BLKF), 6
#define PSMC1BLKF7                       BANKMASK(PSMC1BLKF), 7
#define PSMC1BLKR0                       BANKMASK(PSMC1BLKR), 0
#define PSMC1BLKR1                       BANKMASK(PSMC1BLKR), 1
#define PSMC1BLKR2                       BANKMASK(PSMC1BLKR), 2
#define PSMC1BLKR3                       BANKMASK(PSMC1BLKR), 3
#define PSMC1BLKR4                       BANKMASK(PSMC1BLKR), 4
#define PSMC1BLKR5                       BANKMASK(PSMC1BLKR), 5
#define PSMC1BLKR6                       BANKMASK(PSMC1BLKR), 6
#define PSMC1BLKR7                       BANKMASK(PSMC1BLKR), 7
#define PSMC1DBF0                        BANKMASK(PSMC1DBF), 0
#define PSMC1DBF1                        BANKMASK(PSMC1DBF), 1
#define PSMC1DBF2                        BANKMASK(PSMC1DBF), 2
#define PSMC1DBF3                        BANKMASK(PSMC1DBF), 3
#define PSMC1DBF4                        BANKMASK(PSMC1DBF), 4
#define PSMC1DBF5                        BANKMASK(PSMC1DBF), 5
#define PSMC1DBF6                        BANKMASK(PSMC1DBF), 6
#define PSMC1DBF7                        BANKMASK(PSMC1DBF), 7
#define PSMC1DBR0                        BANKMASK(PSMC1DBR), 0
#define PSMC1DBR1                        BANKMASK(PSMC1DBR), 1
#define PSMC1DBR2                        BANKMASK(PSMC1DBR), 2
#define PSMC1DBR3                        BANKMASK(PSMC1DBR), 3
#define PSMC1DBR4                        BANKMASK(PSMC1DBR), 4
#define PSMC1DBR5                        BANKMASK(PSMC1DBR), 5
#define PSMC1DBR6                        BANKMASK(PSMC1DBR), 6
#define PSMC1DBR7                        BANKMASK(PSMC1DBR), 7
#define PSMC1DC0                         BANKMASK(PSMC1DCL), 0
#define PSMC1DC1                         BANKMASK(PSMC1DCL), 1
#define PSMC1DC10                        BANKMASK(PSMC1DCH), 2
#define PSMC1DC11                        BANKMASK(PSMC1DCH), 3
#define PSMC1DC12                        BANKMASK(PSMC1DCH), 4
#define PSMC1DC13                        BANKMASK(PSMC1DCH), 5
#define PSMC1DC14                        BANKMASK(PSMC1DCH), 6
#define PSMC1DC15                        BANKMASK(PSMC1DCH), 7
#define PSMC1DC2                         BANKMASK(PSMC1DCL), 2
#define PSMC1DC3                         BANKMASK(PSMC1DCL), 3
#define PSMC1DC4                         BANKMASK(PSMC1DCL), 4
#define PSMC1DC5                         BANKMASK(PSMC1DCL), 5
#define PSMC1DC6                         BANKMASK(PSMC1DCL), 6
#define PSMC1DC7                         BANKMASK(PSMC1DCL), 7
#define PSMC1DC8                         BANKMASK(PSMC1DCH), 0
#define PSMC1DC9                         BANKMASK(PSMC1DCH), 1
#define PSMC1EN                          BANKMASK(PSMC1CON), 7
#define PSMC1FFA0                        BANKMASK(PSMC1FFA), 0
#define PSMC1FFA1                        BANKMASK(PSMC1FFA), 1
#define PSMC1FFA2                        BANKMASK(PSMC1FFA), 2
#define PSMC1FFA3                        BANKMASK(PSMC1FFA), 3
#define PSMC1LD                          BANKMASK(PSMC1CON), 6
#define PSMC1PH0                         BANKMASK(PSMC1PHL), 0
#define PSMC1PH1                         BANKMASK(PSMC1PHL), 1
#define PSMC1PH10                        BANKMASK(PSMC1PHH), 2
#define PSMC1PH11                        BANKMASK(PSMC1PHH), 3
#define PSMC1PH12                        BANKMASK(PSMC1PHH), 4
#define PSMC1PH13                        BANKMASK(PSMC1PHH), 5
#define PSMC1PH14                        BANKMASK(PSMC1PHH), 6
#define PSMC1PH15                        BANKMASK(PSMC1PHH), 7
#define PSMC1PH2                         BANKMASK(PSMC1PHL), 2
#define PSMC1PH3                         BANKMASK(PSMC1PHL), 3
#define PSMC1PH4                         BANKMASK(PSMC1PHL), 4
#define PSMC1PH5                         BANKMASK(PSMC1PHL), 5
#define PSMC1PH6                         BANKMASK(PSMC1PHL), 6
#define PSMC1PH7                         BANKMASK(PSMC1PHL), 7
#define PSMC1PH8                         BANKMASK(PSMC1PHH), 0
#define PSMC1PH9                         BANKMASK(PSMC1PHH), 1
#define PSMC1PR0                         BANKMASK(PSMC1PRL), 0
#define PSMC1PR1                         BANKMASK(PSMC1PRL), 1
#define PSMC1PR10                        BANKMASK(PSMC1PRH), 2
#define PSMC1PR11                        BANKMASK(PSMC1PRH), 3
#define PSMC1PR12                        BANKMASK(PSMC1PRH), 4
#define PSMC1PR13                        BANKMASK(PSMC1PRH), 5
#define PSMC1PR14                        BANKMASK(PSMC1PRH), 6
#define PSMC1PR15                        BANKMASK(PSMC1PRH), 7
#define PSMC1PR2                         BANKMASK(PSMC1PRL), 2
#define PSMC1PR3                         BANKMASK(PSMC1PRL), 3
#define PSMC1PR4                         BANKMASK(PSMC1PRL), 4
#define PSMC1PR5                         BANKMASK(PSMC1PRL), 5
#define PSMC1PR6                         BANKMASK(PSMC1PRL), 6
#define PSMC1PR7                         BANKMASK(PSMC1PRL), 7
#define PSMC1PR8                         BANKMASK(PSMC1PRH), 0
#define PSMC1PR9                         BANKMASK(PSMC1PRH), 1
#define PSMC1SIE                         BANKMASK(PIE4), 0
#define PSMC1SIF                         BANKMASK(PIR4), 0
#define PSMC1TIE                         BANKMASK(PIE4), 4
#define PSMC1TIF                         BANKMASK(PIR4), 4
#define PSMC1TMR0                        BANKMASK(PSMC1TMRL), 0
#define PSMC1TMR1                        BANKMASK(PSMC1TMRL), 1
#define PSMC1TMR10                       BANKMASK(PSMC1TMRH), 2
#define PSMC1TMR11                       BANKMASK(PSMC1TMRH), 3
#define PSMC1TMR12                       BANKMASK(PSMC1TMRH), 4
#define PSMC1TMR13                       BANKMASK(PSMC1TMRH), 5
#define PSMC1TMR14                       BANKMASK(PSMC1TMRH), 6
#define PSMC1TMR15                       BANKMASK(PSMC1TMRH), 7
#define PSMC1TMR2                        BANKMASK(PSMC1TMRL), 2
#define PSMC1TMR3                        BANKMASK(PSMC1TMRL), 3
#define PSMC1TMR4                        BANKMASK(PSMC1TMRL), 4
#define PSMC1TMR5                        BANKMASK(PSMC1TMRL), 5
#define PSMC1TMR6                        BANKMASK(PSMC1TMRL), 6
#define PSMC1TMR7                        BANKMASK(PSMC1TMRL), 7
#define PSMC1TMR8                        BANKMASK(PSMC1TMRH), 0
#define PSMC1TMR9                        BANKMASK(PSMC1TMRH), 1
#define PSMC2BLKF0                       BANKMASK(PSMC2BLKF), 0
#define PSMC2BLKF1                       BANKMASK(PSMC2BLKF), 1
#define PSMC2BLKF2                       BANKMASK(PSMC2BLKF), 2
#define PSMC2BLKF3                       BANKMASK(PSMC2BLKF), 3
#define PSMC2BLKF4                       BANKMASK(PSMC2BLKF), 4
#define PSMC2BLKF5                       BANKMASK(PSMC2BLKF), 5
#define PSMC2BLKF6                       BANKMASK(PSMC2BLKF), 6
#define PSMC2BLKF7                       BANKMASK(PSMC2BLKF), 7
#define PSMC2BLKR0                       BANKMASK(PSMC2BLKR), 0
#define PSMC2BLKR1                       BANKMASK(PSMC2BLKR), 1
#define PSMC2BLKR2                       BANKMASK(PSMC2BLKR), 2
#define PSMC2BLKR3                       BANKMASK(PSMC2BLKR), 3
#define PSMC2BLKR4                       BANKMASK(PSMC2BLKR), 4
#define PSMC2BLKR5                       BANKMASK(PSMC2BLKR), 5
#define PSMC2BLKR6                       BANKMASK(PSMC2BLKR), 6
#define PSMC2BLKR7                       BANKMASK(PSMC2BLKR), 7
#define PSMC2DBF0                        BANKMASK(PSMC2DBF), 0
#define PSMC2DBF1                        BANKMASK(PSMC2DBF), 1
#define PSMC2DBF2                        BANKMASK(PSMC2DBF), 2
#define PSMC2DBF3                        BANKMASK(PSMC2DBF), 3
#define PSMC2DBF4                        BANKMASK(PSMC2DBF), 4
#define PSMC2DBF5                        BANKMASK(PSMC2DBF), 5
#define PSMC2DBF6                        BANKMASK(PSMC2DBF), 6
#define PSMC2DBF7                        BANKMASK(PSMC2DBF), 7
#define PSMC2DBR0                        BANKMASK(PSMC2DBR), 0
#define PSMC2DBR1                        BANKMASK(PSMC2DBR), 1
#define PSMC2DBR2                        BANKMASK(PSMC2DBR), 2
#define PSMC2DBR3                        BANKMASK(PSMC2DBR), 3
#define PSMC2DBR4                        BANKMASK(PSMC2DBR), 4
#define PSMC2DBR5                        BANKMASK(PSMC2DBR), 5
#define PSMC2DBR6                        BANKMASK(PSMC2DBR), 6
#define PSMC2DBR7                        BANKMASK(PSMC2DBR), 7
#define PSMC2DC0                         BANKMASK(PSMC2DCL), 0
#define PSMC2DC1                         BANKMASK(PSMC2DCL), 1
#define PSMC2DC10                        BANKMASK(PSMC2DCH), 2
#define PSMC2DC11                        BANKMASK(PSMC2DCH), 3
#define PSMC2DC12                        BANKMASK(PSMC2DCH), 4
#define PSMC2DC13                        BANKMASK(PSMC2DCH), 5
#define PSMC2DC14                        BANKMASK(PSMC2DCH), 6
#define PSMC2DC15                        BANKMASK(PSMC2DCH), 7
#define PSMC2DC2                         BANKMASK(PSMC2DCL), 2
#define PSMC2DC3                         BANKMASK(PSMC2DCL), 3
#define PSMC2DC4                         BANKMASK(PSMC2DCL), 4
#define PSMC2DC5                         BANKMASK(PSMC2DCL), 5
#define PSMC2DC6                         BANKMASK(PSMC2DCL), 6
#define PSMC2DC7                         BANKMASK(PSMC2DCL), 7
#define PSMC2DC8                         BANKMASK(PSMC2DCH), 0
#define PSMC2DC9                         BANKMASK(PSMC2DCH), 1
#define PSMC2EN                          BANKMASK(PSMC2CON), 7
#define PSMC2FFA0                        BANKMASK(PSMC2FFA), 0
#define PSMC2FFA1                        BANKMASK(PSMC2FFA), 1
#define PSMC2FFA2                        BANKMASK(PSMC2FFA), 2
#define PSMC2FFA3                        BANKMASK(PSMC2FFA), 3
#define PSMC2LD                          BANKMASK(PSMC2CON), 6
#define PSMC2PH0                         BANKMASK(PSMC2PHL), 0
#define PSMC2PH1                         BANKMASK(PSMC2PHL), 1
#define PSMC2PH10                        BANKMASK(PSMC2PHH), 2
#define PSMC2PH11                        BANKMASK(PSMC2PHH), 3
#define PSMC2PH12                        BANKMASK(PSMC2PHH), 4
#define PSMC2PH13                        BANKMASK(PSMC2PHH), 5
#define PSMC2PH14                        BANKMASK(PSMC2PHH), 6
#define PSMC2PH15                        BANKMASK(PSMC2PHH), 7
#define PSMC2PH2                         BANKMASK(PSMC2PHL), 2
#define PSMC2PH3                         BANKMASK(PSMC2PHL), 3
#define PSMC2PH4                         BANKMASK(PSMC2PHL), 4
#define PSMC2PH5                         BANKMASK(PSMC2PHL), 5
#define PSMC2PH6                         BANKMASK(PSMC2PHL), 6
#define PSMC2PH7                         BANKMASK(PSMC2PHL), 7
#define PSMC2PH8                         BANKMASK(PSMC2PHH), 0
#define PSMC2PH9                         BANKMASK(PSMC2PHH), 1
#define PSMC2PR0                         BANKMASK(PSMC2PRL), 0
#define PSMC2PR1                         BANKMASK(PSMC2PRL), 1
#define PSMC2PR10                        BANKMASK(PSMC2PRH), 2
#define PSMC2PR11                        BANKMASK(PSMC2PRH), 3
#define PSMC2PR12                        BANKMASK(PSMC2PRH), 4
#define PSMC2PR13                        BANKMASK(PSMC2PRH), 5
#define PSMC2PR14                        BANKMASK(PSMC2PRH), 6
#define PSMC2PR15                        BANKMASK(PSMC2PRH), 7
#define PSMC2PR2                         BANKMASK(PSMC2PRL), 2
#define PSMC2PR3                         BANKMASK(PSMC2PRL), 3
#define PSMC2PR4                         BANKMASK(PSMC2PRL), 4
#define PSMC2PR5                         BANKMASK(PSMC2PRL), 5
#define PSMC2PR6                         BANKMASK(PSMC2PRL), 6
#define PSMC2PR7                         BANKMASK(PSMC2PRL), 7
#define PSMC2PR8                         BANKMASK(PSMC2PRH), 0
#define PSMC2PR9                         BANKMASK(PSMC2PRH), 1
#define PSMC2SIE                         BANKMASK(PIE4), 1
#define PSMC2SIF                         BANKMASK(PIR4), 1
#define PSMC2TIE                         BANKMASK(PIE4), 5
#define PSMC2TIF                         BANKMASK(PIR4), 5
#define PSMC2TMR0                        BANKMASK(PSMC2TMRL), 0
#define PSMC2TMR1                        BANKMASK(PSMC2TMRL), 1
#define PSMC2TMR10                       BANKMASK(PSMC2TMRH), 2
#define PSMC2TMR11                       BANKMASK(PSMC2TMRH), 3
#define PSMC2TMR12                       BANKMASK(PSMC2TMRH), 4
#define PSMC2TMR13                       BANKMASK(PSMC2TMRH), 5
#define PSMC2TMR14                       BANKMASK(PSMC2TMRH), 6
#define PSMC2TMR15                       BANKMASK(PSMC2TMRH), 7
#define PSMC2TMR2                        BANKMASK(PSMC2TMRL), 2
#define PSMC2TMR3                        BANKMASK(PSMC2TMRL), 3
#define PSMC2TMR4                        BANKMASK(PSMC2TMRL), 4
#define PSMC2TMR5                        BANKMASK(PSMC2TMRL), 5
#define PSMC2TMR6                        BANKMASK(PSMC2TMRL), 6
#define PSMC2TMR7                        BANKMASK(PSMC2TMRL), 7
#define PSMC2TMR8                        BANKMASK(PSMC2TMRH), 0
#define PSMC2TMR9                        BANKMASK(PSMC2TMRH), 1
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
